<?php

header("Content-Type: text/html; charset=utf-8");

/**
 * Τύποι Συνταρτήσεων
 *
 * Παρακάτω εμφανίζονται οι Τύποι Συνταρτήσεων οι οποίοι παρέχονται μέσω του ΑΡΙ για την κλήση των συναρτήσεων.
 *
 */

class MethodTypes
{

    /**
     * Ο Τύπος Συνάρτησης επιστρέφει...
     */
    const GET = "GET";


    /**
     * Ο Τύπος Συνάρτησης επιστρέφει...
     */
    const POST = "POST";

    /**
     * Ο Τύπος Συνάρτησης επιστρέφει...
     */
    const PUT = "PUT";

    /**
     * Ο Τύπος Συνάρτησης επιστρέφει...
     */
    const DELETE = "DELETE";

}
?>